In [4]:
import numpy as np

In [10]:
# creating arrays using numpy
#  a 1 D array
arr1 = np.array([1,2,3,4,5])
arr2 = arr1.reshape(1,5)
print(arr2)

[[1 2 3 4 5]]

In [34]:
a1 = np.array([[1,2,3,4,5], [3,4,3,2,4],[3,4,2,6,7]])
a1[:2,3:]

array([[4, 5],
       [2, 4]])

In [38]:
import pandas as pd

In [42]:
data = {'number': [1,2,3,4,5],
        'letter': ['a','b','c','d','e'],
        'number2': [6,7,8,9,10],
        }
dataframe = pd.DataFrame(data)
print(dataframe)

   number letter  number2
0       1      a        6
1       2      b        7
2       3      c        8
3       4      d        9
4       5      e       10

In [43]:
data = [{"name": "vishu", "age":18},
        {"name": "avi", "age":14},
        {"name": "anshul", "age":38},
        {"name": "akanksha", "age":14},
        {"name": "Ip", "age":23},
        {"name": "sanika"}
        ]
df = pd.DataFrame(data)
print(df)

       name   age
0     vishu  18.0
1       avi  14.0
2    anshul  38.0
3  akanksha  14.0
4        Ip  23.0
5    sanika   NaN

In [73]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,month_number,facecream,facewash,toothpaste,bathingsoap,shampoo,moisturizer,total_units,total_profit
0,1,2500,1500,5200,9200,1200,1500,21100,211000
1,2,2630,1200,5100,6100,2100,1200,18330,183300
2,3,2140,1340,4550,9550,3550,1340,22470,224700
3,4,3400,1130,5870,8870,1870,1130,22270,222700
4,5,3600,1740,4560,7760,1560,1740,20960,209600

In [63]:
# accesing data from data frame
# df['facewash']
df.loc[0]   # to print the index'th Row
df.iloc[0][4]  #specifically working for any index
df.at[2, "bathingsoap"]
df.iat[2,2]

/var/folders/mm/s0c3yqgs78g6vqxrjb2t33jc0000gn/T/ipykernel_7907/980023098.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][4]  #specifically working for any index

np.int64(1340)

In [74]:
# adding a column
# df['new column'] = 0
# df.at[5, 'new column']

In [77]:
df.describe()  #gives the statistical summary of data

,month_number,facecream,facewash,toothpaste,bathingsoap,shampoo,moisturizer,total_units,total_profit
count,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.00000,12.000000
mean,6.500000,2873.333333,1542.916667,5825.833333,9500.833333,2117.500000,1542.916667,26027.50000,260275.000000
std,3.605551,584.595172,316.733745,1242.032486,2348.095779,617.724931,316.733745,7014.36594,70143.659404
min,1.000000,1990.000000,1120.000000,4550.000000,6100.000000,1200.000000,1120.000000,18330.00000,183300.000000
25%,3.750000,2460.000000,1305.000000,4862.500000,8015.000000,1795.000000,1305.000000,21065.00000,210650.000000
50%,6.500000,2830.000000,1527.500000,5530.000000,9090.000000,1995.000000,1527.500000,22935.00000,229350.000000
75%,9.250000,3435.000000,1765.000000,6400.000000,10045.000000,2325.000000,1765.000000,29667.50000,296675.000000
max,12.000000,3700.000000,2100.000000,8300.000000,14400.000000,3550.000000,2100.000000,41280.00000,412800.000000